IDENTIFICATION DIVISION.
PROGRAM-ID. ExampleCobolProgram1.
AUTHOR. JJ.

DATA DIVISION.
  WORKING-STORAGE SECTION.
  01  NUM1 PIC 9  VALUE 1.
  01  NUM2 PIC 999 VALUE 100.
  01  NUM3 PIC 999.
  01  NUM4 PIC 99.
  01  NUM5 PIC 99 value 10.
  01  NUM6 PIC 99.


PROCEDURE DIVISION.
  MAIN.
  MULTIPLY NUM1 BY NUM2 GIVING NUM3.  DISPLAY 'Product is ', NUM3.
  COMPUTE NUM3 = NUM1 + NUM2.
  DISPLAY 'NUM3 is ', NUM3.
  SUBTRACT NUM3 FROM NUM2 GIVING NUM4.
  DISPLAY 'NUM4 is ', NUM4.

  IF NUM1 > NUM2 THEN
    DISPLAY 'IN IF BLOCK'
  ELSE
    DISPLAY 'IN ELSE BLOCK'
  END-IF

  EVALUATE TRUE
    WHEN NUM1 < 2
      DISPLAY 'NUM1 LESS THAN 2'
    WHEN NUM1 < 20
      DISPLAY 'NUM1 LESS THAN 20'
  END-EVALUATE.







  STOP RUN.
