IDENTIFICATION DIVISION.
PROGRAM-ID. ExampleCobolProgram1.
AUTHOR. JJ.

DATA DIVISION.
  WORKING-STORAGE SECTION.
  01  NUM1 PIC 9  VALUE 1.
  01  NUM2 PIC 999 VALUE 100.
  01  NUM3 PIC 999.

PROCEDURE DIVISION.
  MAIN.
  MULTIPLY NUM1 BY NUM2 GIVING NUM3.  DISPLAY 'Product is ', NUM3.
  STOP RUN.
